In [1]:
# Ensure pandas is installed
%pip install pandas -q

# Restart the kernel if the issue persists
import pandas as pd

Note: you may need to restart the kernel to use updated packages.

In [3]:
# Lendo o arquivo .csv(necessita Falar o destinatario do arquivo)

dados = pd.read_csv('./vendas.csv', sep=';')

In [6]:
print(type(dados))

<class 'pandas.core.frame.DataFrame'>

In [7]:
dados

,ID_Pedido,Data_Compra,Cliente_ID,Valor_Total,Categoria_Produto,Quantidade
0,1001,2024-03-01,501,150.75,Eletrônicos,1
1,1002,2024-03-02,502,200.50,Roupas,3
2,1003,2024-03-03,503,320.00,Casa,2
3,1004,2024-03-04,501,90.25,Eletrônicos,1
4,1005,2024-03-05,504,450.60,Esportes,4

# analise exploratoria
trata-se de um reconhecimento inicial dos dados presentes no dataset

In [5]:
# Vizualizar as linhas iniciais do dataset

dados.head()

,ID_Pedido,Data_Compra,Cliente_ID,Valor_Total,Categoria_Produto,Quantidade
0,1001,2024-03-01,501,150.75,Eletrônicos,1
1,1002,2024-03-02,502,200.50,Roupas,3
2,1003,2024-03-03,503,320.00,Casa,2
3,1004,2024-03-04,501,90.25,Eletrônicos,1
4,1005,2024-03-05,504,450.60,Esportes,4

In [21]:
# Vizualiza as linhas iniciais dos dados
dados.head()

,ID_Pedido,Data_Compra,Cliente_ID,Valor_Total,Categoria_Produto,Quantidade
0,1001,2024-03-01,501,150.75,Eletrônicos,1
1,1002,2024-03-02,502,200.50,Roupas,3
2,1003,2024-03-03,503,320.00,Casa,2
3,1004,2024-03-04,501,90.25,Eletrônicos,1
4,1005,2024-03-05,504,450.60,Esportes,4

In [22]:
# Vizualiza as linhas finais do dataset
dados.tail()

,ID_Pedido,Data_Compra,Cliente_ID,Valor_Total,Categoria_Produto,Quantidade
0,1001,2024-03-01,501,150.75,Eletrônicos,1
1,1002,2024-03-02,502,200.50,Roupas,3
2,1003,2024-03-03,503,320.00,Casa,2
3,1004,2024-03-04,501,90.25,Eletrônicos,1
4,1005,2024-03-05,504,450.60,Esportes,4

In [23]:
#  Mostra a quantidade de linhas e series (colunas)
dados

,ID_Pedido,Data_Compra,Cliente_ID,Valor_Total,Categoria_Produto,Quantidade
0,1001,2024-03-01,501,150.75,Eletrônicos,1
1,1002,2024-03-02,502,200.50,Roupas,3
2,1003,2024-03-03,503,320.00,Casa,2
3,1004,2024-03-04,501,90.25,Eletrônicos,1
4,1005,2024-03-05,504,450.60,Esportes,4

In [24]:
variancia = dados['Valor_Total'].var()
mediana = dados['Valor_Total'].median()

print(f'variancia: {variancia}')
print(f'mediana: {mediana}')

variancia: 20668.488250000002
mediana: 200.5

In [25]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID_Pedido          5 non-null      int64
 1   Data_Compra        5 non-null      object
 2   Cliente_ID         5 non-null      int64
 3   Valor_Total        5 non-null      float64
 4   Categoria_Produto  5 non-null      object
 5   Quantidade         5 non-null      int64
dtypes: float64(1), int64(3), object(2)
memory usage: 372.0+ bytes

In [26]:
dados['Categoria_Produto'].unique()

array(['Eletrônicos', 'Roupas', 'Casa', 'Esportes'], dtype=object)

In [27]:
dados['Categoria_Produto'].value_counts()

Categoria_Produto
Eletrônicos    2
Roupas         1
Casa           1
Esportes       1
Name: count, dtype: int64

In [28]:
# vizualizar nomes das colunas
dados.rename(columns={'Data_Compra': 'Dt_Compra'})

,ID_Pedido,Dt_Compra,Cliente_ID,Valor_Total,Categoria_Produto,Quantidade
0,1001,2024-03-01,501,150.75,Eletrônicos,1
1,1002,2024-03-02,502,200.50,Roupas,3
2,1003,2024-03-03,503,320.00,Casa,2
3,1004,2024-03-04,501,90.25,Eletrônicos,1
4,1005,2024-03-05,504,450.60,Esportes,4

In [29]:
colunas = ['pedido', 'data', 'cliente', 'valor', 'qntd']

In [30]:
colunas_minusculas = []

colunas_maisculas = []

for coluna in list(dados.columns):
    colunas_maisculas.append(coluna.upper())

display(colunas_maisculas)

['ID_PEDIDO',
 'DATA_COMPRA',
 'CLIENTE_ID',
 'VALOR_TOTAL',
 'CATEGORIA_PRODUTO',
 'QUANTIDADE']